Documents/КорректировкаРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>КорректировкаРегистров</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоДоговорам</xr:Item>
				<xr:Item>InformationRegister.АктуализацияГрафика</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияПоГоспошлине</xr:Item>
				<xr:Item>InformationRegister.ИдентификаторыСообщенийБанкротство</xr:Item>
				<xr:Item>InformationRegister.ФССП_СостояниеИП</xr:Item>
				<xr:Item>InformationRegister.ЗагруженныеОбъекты</xr:Item>
				<xr:Item>AccumulationRegister.ФССП_ЗадолженностьПоИП</xr:Item>
				<xr:Item>AccumulationRegister.СостоянияПоКатегориям</xr:Item>
				<xr:Item>InformationRegister.УдалитьИсковыеТребования</xr:Item>
				<xr:Item>InformationRegister.ПериодыПросрочки</xr:Item>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
				<xr:Item>AccumulationRegister.ИсковыеТребования</xr:Item>
				<xr:Item>InformationRegister.СтатусыШПИРегистрация</xr:Item>
				<xr:Item>AccumulationRegister.ИсторияПлатежей</xr:Item>
				<xr:Item>InformationRegister.ХранилищеДанныхТабличныхДокументов</xr:Item>
				<xr:Item>AccumulationRegister.СостоянияПоАвтоинформированию</xr:Item>
				<xr:Item>AccumulationRegister.ФССП_ЗадолженностьПоПредметамИП</xr:Item>
				<xr:Item>InformationRegister.ПрикрепляемыеФайлы</xr:Item>
				<xr:Item>InformationRegister.ЖурналПроданныхДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
				<xr:Item>InformationRegister.ДанныеСообщенийОБанкротстве</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КорректировкаРегистров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Корректировка регистров".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений, Неопределено - строка таблицы команд.
// 
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.КорректировкаРегистров) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.КорректировкаРегистров.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ПредставлениеОбъекта(Метаданные.Документы.КорректировкаРегистров);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.КорректировкаРегистров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.3.43";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("920a64c8-e96b-4b82-a263-1097822405c9");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.КорректировкаРегистров.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизит ""Операция"" значением по умолчанию ""Ручная корректировка""'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.КорректировкаРегистров.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.КорректировкаРегистров.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Документы.КорректировкаРегистров.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Заполняет реквизит "Операция" значением по умолчанию "Ручная корректировка"
// 
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	//ОбновлениеИнформационнойБазыУТ.ЗаполнитьПустойРеквизитЗначениемПоУмолчаниюЗарегистрироватьДанныеКОбработке(
	//	Параметры,
	//	"Документ.КорректировкаРегистров",
	//	"Операция");
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	//ОбновлениеИнформационнойБазыУТ.ЗаполнитьПустойРеквизитЗначениемПоУмолчанию(
	//	Параметры,
	//	"Документ.КорректировкаРегистров",
	//	"Операция",
	//	Перечисления.ОперацииКорректировкиРегистров.РучнаяКорректировка);
	
КонецПроцедуры

#КонецОбласти

// Возвращает представление переданного объекта.
//
// Параметры:
//	ПараметрОбъект - Строка - 
//	               - ОбъектМетаданных - объект для получения представления
//
// Возвращаемое значение:
//	Строка - представление объекта
//
Функция ПредставлениеОбъекта(ПараметрОбъект) Экспорт
	
	Если ПараметрОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	МетаданныеОбъекта = ?(ТипЗнч(ПараметрОбъект) = Тип("Строка"), Метаданные.НайтиПоПолномуИмени(ПараметрОбъект), ПараметрОбъект);
	
	Представление = Новый Структура("ПредставлениеОбъекта");
	ЗаполнитьЗначенияСвойств(Представление, МетаданныеОбъекта);
	Если Не ПустаяСтрока(Представление.ПредставлениеОбъекта) Тогда
		Возврат Представление.ПредставлениеОбъекта;
	КонецЕсли;
	
	Возврат МетаданныеОбъекта.Представление();
	
КонецФункции


#КонецОбласти

#КонецЕсли
